In [4]:
import pandas as pd
from pandas import DataFrame

In [5]:
#create a new dataframe in pandas

In [6]:
courseData = { 'courseCode': ['TM351', 'TU100', 'M269'],
               'points':[30, 60, 30],
               'level':['3', '1', '2']
             }
course_df = DataFrame(courseData)
course_df

  courseCode level  points
0      TM351     3      30
1      TU100     1      60
2       M269     2      30

In [16]:
#create a new dataframe using named columns
courseColumns = ['courseCode', 'difficulty']
courseData2 = { 'courseCode':['TM351', 'TU100', 'M269'],
               'difficulty':['easy', 'medium', 'insane']
             }
course_df2 = DataFrame(data=courseData2, columns=courseColumns)
course_df2

  courseCode difficulty
0      TM351       easy
1      TU100     medium
2       M269     insane

In [10]:
#projecting columns
course_df[['courseCode', 'level']]

  courseCode level
0      TM351     3
1      TU100     1
2       M269     2

In [18]:
#selecting rows
course_df[(course_df['courseCode'] == 'TM351' )]

  courseCode level  points
0      TM351     3      30

In [22]:
#examinng dataframe types, and casting
course_df[ ['level', 'points'] ] = course_df[ ['level', 'points'] ].astype(float)
course_df.dtypes

courseCode     object
level         float64
points        float64
dtype: object

In [ ]:
#Adding 2 dataframes together (add rows)
#by default, all columns are added (outer join). To add only common columns use join='inner' option

In [19]:
courses_comb_df = pd.concat([course_df, course_df])
courses_comb_df

  courseCode level  points
0      TM351     3      30
1      TU100     1      60
2       M269     2      30
0      TM351     3      30
1      TU100     1      60
2       M269     2      30

In [25]:
#merging 2 dataframes together (add columns)
courses_comb_df = pd.merge(course_df, course_df2, on=['courseCode'])
courses_comb_df

  courseCode level  points difficulty
0      TM351     3      30       easy
1      TU100     1      60     medium
2       M269     2      30     insane